[{"id":3327,"published":"2025-08-12T06:59:42Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThe Nanos Sector has been liberated, and a clear message has been sent to the Automatons in a powerful show of force. The overwhelming firepower of Freedom has been utilized to great effect: the citizens of <i=1>New Aspiration City</i> on Emeria are safe."},{"id":3326,"published":"2025-08-11T13:57:42Z","type":0,"message":"<i=3>ARSENAL AUGMENTATION</i>\n\nHigh Command has authorized fleetwide use of the <i=1>Orbital Railcannon Stratagem</i> with <i=1>reduced waiting period between calldowns</i> in the Andromeda Sector for the next 42 hours."},{"id":3325,"published":"2025-08-09T11:13:58Z","type":0,"message":"<i=3>AUTOMATON SECURE DATA MOVED</i>\n\nThe Automatons appear to have discovered our attempts to liberate the secure database on <i=1>CHARBAL-VII.</i> Intel reports the database has been shut down, with all secret data moved off-planet. Liberating the planet is no longer expected to provide a significant benefit to military intelligence."},{"id":3324,"published":"2025-08-08T08:24:04Z","type":0,"message":"<i=3>ARSENAL BOOST</i>\n\nHigh Command has authorized high-volume use of the <i=1>Orbital Railcannon Stratagem</i> in the Nanos Sector. For operations in that sector, the mandated waiting period between salvos has been lowered by <i=1>150 seconds</i> for the next 96 hours."},{"id":3323,"published":"2025-08-07T11:13:34Z","type":0,"message":"<i=3>NEW STRATEGIC OPPORTUNITY</i>\n\nIntercepted Automaton messages have identified a secure database on <i=1>CHARBAL-VII.</i> This presents a rare opportunity to discover enemy plans; if captured, it could provide critical data on upcoming enemy troop movements."},{"id":3322,"published":"2025-08-07T08:52:42Z","type":0,"message":"<i=3>ARSENAL AUGMENTATION</i>\n\nHigh Command has authorized the fleetwide use of the <i=1>Orbital Railcannon Stratagem</i> for the next <i=1>96 hours.</i> \n\nThe use of this mighty weapon to so irreversibly dismantle Automaton Conscripts will send a clear message to our enemies: threats to Democracy will result in nothing less than total annihilation."},{"id":3321,"published":"2025-08-06T06:55:12Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i> \n\nThe Helldivers are ordered to clear the <i=1>Nanos Sector</i> to secure New Aspiration City. \n\nAdditionally, in order to prove to the Automatons—and the Federation—that their brutish scare tactics are ineffective, the Helldivers are ordered to <i=1>destroy the designated number of Automaton Conscripts with the Railcannon Stratagem.</i> "},{"id":3320,"published":"2025-08-05T11:17:27Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThanks to the security and Terminid tissue provided by the Helldivers, the Center of Science has successfully designed a process by which to mass-produce <i=1>Gloom-resistent polymer coating.</i>\n\nConsult your Galactic Map for more information."},{"id":3319,"published":"2025-08-02T11:55:49Z","type":0,"message":"<i=3>SPORE BURST SCAVENGER RAMPAGE</i>\n\nSignificantly increased levels of <i=1>Spore Burst Scavengers</i> have been reported on <i=1>TURING.</i>"},{"id":3318,"published":"2025-08-01T20:50:13Z","type":0,"message":"<i=3>SPORE BURST SCAVENGER RAMPAGE</i>\n\nSignificantly increased levels of <i=1>Spore Burst Scavengers</i> have been reported on <i=1>ACHERNAR SECUNDUS.</i>"},{"id":3317,"published":"2025-08-01T12:43:09Z","type":0,"message":"<i=3>SPORE BURST SCAVENGER RAMPAGE</i>\n\nSignificantly increased levels of <i=1>Spore Burst Scavengers</i> have been reported on <i=1>GAR HAREN.</i>"},{"id":3316,"published":"2025-07-31T06:07:37Z","type":0,"message":"<i=3>SPORE BURST SCAVENGER RAMPAGE</i>\n\nSignificantly increased levels of <i=1>Spore Burst Scavengers</i> have been reported on <i=1>CRIMSICA.</i>"},{"id":3315,"published":"2025-07-30T17:24:54Z","type":0,"message":"<i=3>SPORE BURST SCAVENGER RAMPAGE</i>\n\nSignificantly increased levels of <i=1>Spore Burst Scavengers</i> have been reported on <i=1>ACAMAR IV.</i>"},{"id":3313,"published":"2025-07-30T11:15:14Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nNew Alcubiere Drive shielding technology could lead to a new era of Gloom exploration. Meanwhile, <i=1>Spore Burst Terminids</i> originating from FORI PRIME have spread outside the Gloom, a first for this strain.\n\nThe Helldivers are ordered to <i=1>collect 30,000,000 Rare Terminid Samples,</i> particularly those in the Jin Xi sectors. Additionally, they must <i=1>hold Turing and Achernar Secundus,</i> protecting our brilliant scientists and their vital engineers."},{"id":3312,"published":"2025-07-29T12:44:42Z","type":0,"message":"<i=3>FACTORY STRIDER SURGE ABATED</i>\n\n<i=1>Factory Strider</i> numbers on <i=1>CLAORELL</i> have diminished to normal levels."},{"id":3311,"published":"2025-07-29T12:24:30Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nVigorous, spirited efforts by the Helldivers to generate patriotic war footage for our citizens has had the desired effect. Their acts of valor are now being broadcast to all workplace and home televisions, showcasing the inspiring and visceral destruction of our enemies inflicted by the Helldivers every day. \n\nConsult your Galactic Map for more information."},{"id":3310,"published":"2025-07-29T05:24:57Z","type":0,"message":"<i=1>ARSENAL AUGMENTATION</i>\n\nThe just decimation of the deadly airborne <i=1>Leviathans</i> by the Helldivers has inspired a boost in citizen War Bond purchases. High Command has authorized the temporary addition of the <i=1>EXO-49 Emancipator Exosuit</i> Stratagem to all Helldiver loadouts for the next 8 hours."},{"id":3309,"published":"2025-07-28T15:13:53Z","type":0,"message":"<i=3>MAJOR ORDER ADJUSTMENT</i>\n\nPatriotic footage generated by the Helldivers thus far has had a greater-than-expected impact on citizen inspiration, evidently due to the tactical enthusiasm on display. Innovative Leviathan hunting techniques have had a particularly outsized effect. \n\nConsequently, High Command has <i=1>lowered the required Leviathan kill count by 50%,</i> and authorized deployment of the <i=1>Expendable Anti-Tank</i> Stratagem to facilitate efforts to eliminate this deadly airborne enemy."},{"id":3308,"published":"2025-07-27T17:28:42Z","type":0,"message":"<i=1>ARSENAL AUGMENTATION</i>\n\nRighteous and furious extermination of Terminid <i=1>Impalers</i> by the Helldivers has spurred our citizens to new heights of patriotic generosity. As a result, High Command has authorized the temporary addition of the <i=1>HMG Emplacement</i> Stratagem to all Helldiver loadouts for the next 24 hours."},{"id":3307,"published":"2025-07-27T06:37:42Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY SEIZED</i>\n\nThe Helldivers have successfully exterminated <i=1>5,000,000 Spore Burst Warriors</i> on <i=1>FORI PRIME</i> through effective employment of the <i=1>Stalwart.</i>\n\nA spike in citizen donations to the War Fund has made possible the short-term addition of the <i=1>Orbital Railcannon Strike</i> Stratagem to all Helldiver arsenals for the remainder of the current order."},{"id":3306,"published":"2025-07-26T16:18:42Z","type":0,"message":"<i=1>ARSENAL AUGMENTATION</i>\n\nRighteous and furious extermination of Terminid <i=1>Shriekers</i> by the Helldivers has spurred our citizens to new heights of patriotic generosity. As a result, High Command has authorized the temporary addition of the <i=1>Autocannon</i> Stratagem to all Helldiver loadouts for the next 24 hours."},{"id":3305,"published":"2025-07-26T16:16:07Z","type":0,"message":"M-105 Stalwart stratagem availability has ended."},{"id":3304,"published":"2025-07-25T18:09:24Z","type":0,"message":"<i=1>IMPALER RAMPAGE</i>\n\nSignificantly higher <i=1>Impaler</i> numbers have been observed on <i=1>FORI PRIME.</i>"},{"id":3303,"published":"2025-07-25T16:13:49Z","type":0,"message":"The M-105 Stalwart stratagem is temporarily available to all Helldivers."},{"id":3302,"published":"2025-07-25T16:12:42Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY</i>\n\nIn support of the ongoing public relations campaign, High Command has ordered an short-term expedition to <i=1>FORI PRIME</i> within the outskirts of the Gloom, to exterminate <i=1>5,000,000 Spore Burst Warriors</i> using the <i=1>Stalwart.</i> \n\nThis optional augmentation to the public relations campaign could further boost citizen morale to yet-unforseen heights."},{"id":3300,"published":"2025-07-25T07:40:13Z","type":0,"message":"<i=3>REMEMBRANCE NAME DECIDED</i>\n\nThe Super Earth Mega City of <i=1>Remembrance,</i> tragically destroyed by the Illuminate during the Battle for Super Earth, is being rebuilt. Following a Democratically Managed voting process, the new Mega City has been officially named <i=1>Gun.</i> This patriotic and glorious appellation will ensure that Remembrance will never be forgotten."},{"id":3299,"published":"2025-07-24T16:07:42Z","type":0,"message":"<i=1>ARSENAL AUGMENTATION</i>\nThe just decimation of the Voteless <i=1>Fleshmobs</i> by the Helldivers has inspired a boost in citizen War Bond purchases. High Command has authorized the temporary addition of the <i=1>Recoilless Rifle</i> Stratagem to all Helldiver loadouts for the next 24 hours."},{"id":3298,"published":"2025-07-24T15:33:05Z","type":0,"message":"<i=1>FACTORY STRIDER SURGE</i>\nSignificantly higher <i=1>Factory Strider</i> numbers have been observed on <i=1>CLAORELL.</i>"},{"id":3297,"published":"2025-07-23T11:07:42Z","type":0,"message":"<i=3>OPERATIONS RESTORED</i>\n\n<i=1>DSS Tactical Action</i> resource requirements have been restored to normal."},{"id":3296,"published":"2025-07-22T13:19:42Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nA public relations campaign is being launched to remind our citizens that they are protected by the Galaxy's greatest fighting force. The Helldivers are ordered to <i=1>kill the enemies of Freedom that arise most frequently in citizen nightmares.</i>\n\nConsult your Galactic Map for more information."},{"id":3295,"published":"2025-07-22T09:58:27Z","type":0,"message":"<i=3>MAJOR ORDER FAILED</i>\n\nSuper Earth cities lie in ruins. Millions of innocent families are sheltered in refugee camps. The Automaton invasion has reaped a heavy toll. Worst of all, the DSS facility on <i=1>CLAORELL</i> is in the socialist actuators of the enemy."},{"id":3294,"published":"2025-07-21T23:18:24Z","type":0,"message":"<i=3>OPERATIONS RESTORED</i>\n\n<i=1>DSS Tactical Action</i> activation time has been restored to normal."},{"id":3293,"published":"2025-07-20T11:03:13Z","type":0,"message":"<i=3>CLAORELL HAS FALLEN</i>\n\nThe Automatons have taken <i=1>Claorell,</i> and the <i=1>Deep Mantle Forge Complex</i> on the planet. The enemy has stolen this site of great industry; there is no telling what socialist ends they will use it for. \n\nAs a result of losing the Complex, the resource requirement for all DSS Tactical Actions is <i=1>25% greater</i> for the next <i=1>72 hours.</i>"},{"id":3292,"published":"2025-07-19T08:16:53Z","type":0,"message":"<i=3>GAELLIVARE HAS FALLEN</i>\n\n<i=3>Gaellivare,</i> where the DSS was originally constructed, has been invaded by the Automatons. The DSS Construction Site had been the nexus of coordination and support for the space station since its completion. With its loss, <i=1>cooldown times for all DSS Tactical Actions</i> will be <i=1>24 hours longer</i> until further notice."},{"id":3291,"published":"2025-07-18T07:07:42Z","type":0,"message":"<i=3>STRATEGIC ALERT</i>\n\nThe Automaton <i=1>Incineration Corps</i> has been reported on <i=1>AURORA BAY.</i>"},{"id":3290,"published":"2025-07-18T07:07:42Z","type":0,"message":"<i=3>STRATEGIC ALERT</i>\n\nThe Automaton <i=1>Incineration Corps</i> has been reported on <i=1>MERAK.</i>"},{"id":3289,"published":"2025-07-17T08:26:05Z","type":0,"message":"<i=3>OASIS FALLEN</i>\n\nOASIS has fallen to the Illuminate, forcing the evacuation of cyberwarfare specialists and the annulment of their critical work to circumvent the Automaton defense grid."},{"id":3288,"published":"2025-07-16T08:23:43Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY</i>\n\nMINDEF Cyberwarfare has identified a critical vulnerability in the Automaton network. Specialists on <i=1>OASIS</i> are actively deconstructing firewall bypass nodes at over 120 WPM—but they need more time. And the Illuminate have just launched an invasion of the planet.\n\nIf the Helldivers can repel the Illuminate assault, the cyber specialists may be able to secure intel of high value against the current Automaton invasion."},{"id":3287,"published":"2025-07-15T09:51:08Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nMultiple simultaneous Automaton assaults have been detected on planets with highly-populated Super Earth cities. MININT analysis reports with a high degree of confidence that the strategic objective of this invasion is to take control of key Democracy Space Station facilities.\n\n<i=1>Hold the key DSS facilities at all costs.</i>"},{"id":3286,"published":"2025-07-14T14:37:05Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThe first of many steps toward healing our noble capital planet, and the broken hearts of all citizens, is complete. <i=1>The Helldivers have triumphed,</i> and have secured the foundation upon which the great city of Remembrance will be reborn."},{"id":3285,"published":"2025-07-11T16:15:58Z","type":0,"message":"<i=3>OPERATIONAL ALERT</i>\n\nResource needs for the reconstruction of <i=1>Remembrance</i> appear difficult to reach. High Command has reached a deal with AM Defense to repurpose steel & concrete reserves on <i=1>Achernar Secundus</i> (previously allocated to colony housing) to Remembrance, lowering the required operations for the current Order by 50%. \n\nThe surge in transportation on <i=1>Achernar Secundus</i> has precipitated a Terminid attack. If the planet is lost, the resources will be as well."},{"id":3284,"published":"2025-07-08T14:29:42Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\n<i=1>Remembrance</i>—destroyed during the completely failed Illuminate invasion of Super Earth—will be the first of our fallen Mega Cities to be rebuilt, as selected by the Ministry of Prosperity.\n\nTo reclaim worlds threatened by hostile forces, and seize necessary rebuilding assets, <i=1>the Helldivers must hold all designated planets, and complete the required number of operations.</i>"},{"id":3283,"published":"2025-07-07T11:19:42Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\n<i=1>All live-fire assets for the new Helldiver training facility have been acquired,</i> ensuring the Helldivers’ peerless martial standards will be upheld by those set to bolster their ranks.\n\nConsult your Galactic Map for more information."},{"id":3282,"published":"2025-07-03T15:19:52Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nHigh Command has authorized construction of a new, state-of-the-art Helldiver training facility on <i=1>ZEGEMA PARADISE.</i> \n\nTo support the creation of this facility, Helldivers are ordered to <i=1>liberate the specified Terminid planets</i> to enable follow-on acquisition of live specimens by SEAF units, and to secure <i=1>50,000,000 Terminid Samples</i> to sustain breeding efforts for future training."},{"id":3281,"published":"2025-07-01T01:39:57Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThe latest Automaton offensive—led by the newly-augmented Jet Brigade—has been decisively repelled by the Helldivers. Consult your Galactic Map for more information."},{"id":3280,"published":"2025-06-29T20:09:07Z","type":0,"message":"<i=3>STRATEGIC UPDATE</i>\n\nAIRBURST ROCKET LAUNCHER stratagem availability has now ended."},{"id":3279,"published":"2025-06-28T20:09:18Z","type":0,"message":"<i=3>FORCE AUGMENTATION</i>\n\nTo better counter the Jet Brigade’s newest capabilities, High Command has authorized the <i=1>AIRBURST ROCKET LAUNCHER</i> to be made available fleetwide for the next 24 hours."},{"id":3278,"published":"2025-06-28T19:41:33Z","type":0,"message":"<i=3>THREAT ANALYSIS UPDATE</i>\n\nThe Automaton offensive continues. Field reports corroborate earlier intelligence: the rebuilt Jet Brigade have mastered propulsion of their heavy units.\n\nThe enemy aims to stretch our defensive perimeter to its breaking point. Thin their ranks, deny their unconventional tactics, and turn this enemy back into the scrap they came from."},{"id":3277,"published":"2025-06-27T12:52:42Z","type":0,"message":"<i=3>PATRIOTIC ANNOUNCEMENT</i>\n\nHigh Command has commissioned a special uniform item for all Helldivers, in recognition of their unyielding efforts to ensure the never-ending prosperity of Super Earth.\n\nA new cape will soon be available fleetwide."},{"id":3276,"published":"2025-06-26T11:34:01Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nALERT: <i=1>A large-scale, coordinated Automaton offensive has launched without warning.</i> The Helldivers are to deploy to all systems under attack, and defend all affected planets. Consult your Galactic Map for more information."},{"id":3275,"published":"2025-06-25T22:54:23Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThe Helldivers have successfully collected the mandated war restitution. Consult your Galactic Map for more information."},{"id":3274,"published":"2025-06-24T20:04:11Z","type":0,"message":"M-105 Stalwart stratagem availability has ended."},{"id":3273,"published":"2025-06-23T14:12:59Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY</i>\n\nLong-distance surveys of currently-infested Terminid planets has identified larger-than-usual free E-710 quantities in the upper geological strata.\n\n Liberating these planets would allow acquisition of these E-710 reservoirs, <i=1>reducing the required kill count for the current Major Order by 1,000,000,000 Terminids for each Terminid planet liberated.</i>"},{"id":3272,"published":"2025-06-22T19:59:17Z","type":0,"message":"The M-105 Stalwart stratagem is temporarily available to all Helldivers."},{"id":3271,"published":"2025-06-22T14:20:26Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nPursuant to intergalactic law, <i=1>substantial war reparations are now owed by the Illuminate</i> for their assault on Super Earth, with a tribunal ruling <i=1>the Terminids</i> as bearing secondary liability.\n\nHelldivers: <i=1>execute Illuminate fugitives and cull Terminid abettors,</i> to deliver technology, materiel, E-710, and Justice commensurate with the reparations owed.\n\nConsult your Galactic Map for more information."},{"id":3270,"published":"2025-06-22T13:37:43Z","type":0,"message":"<i=3>MAJOR ORDER FAILED</i>\n\nThe Helldivers' tenacious attempt to reclaim our corrupted cities has failed. Consult your Galactic Map for more information."},{"id":3269,"published":"2025-06-17T13:22:42Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nThe Super Earth Satellite Observation Network has regained operability, revealing that <i=1>Illuminate fugitives have twisted multiple Federation cities into totalitarian strongholds.</i>\n\nHelldivers: <i=1>reclaim these cities for Super Earth.</i> Consult your Galactic Map for more information."},{"id":3268,"published":"2025-06-17T13:01:18Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\n<i=1>The Helldivers have successfully repelled the Terminid assault, securing all five designated urban centers.</i> Consult your Galactic Map for more information."},{"id":3267,"published":"2025-06-17T10:40:56Z","type":0,"message":"<i=3>COMMEMORATIVE CAPE ISSUED</i>\n\nA cape has been issued commemorating the defense of Super Earth from hostile, evil, and threateningly unknowable alien forces. This cape represents the boundless gratitude of all citizens for the Helldivers' selfless and innumerable sacrifices.\n\nThe cape is now available in all Super Destroyer armories. "},{"id":3266,"published":"2025-06-13T15:17:15Z","type":0,"message":"<i=3>SATELLITES SABOTAGED</i>\n\nA deep-space satellite near Super Earth has failed. The Illuminate appear to have planted interference devices during the Battle for Super Earth.\n\nA number of planets in close proximity to Illuminate-occupied planets are no longer observable. Communication has been cut off, and FTL travel to them is impossible. Analysts assess the likelihood of anti-Democratic activity on those planets to be Very High. \n\nA task force is actively working to restore system integrity."},{"id":3265,"published":"2025-06-10T12:56:42Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\n<i=1>Massive Terminid outbreaks have erupted simultaneously across multiple Super Earth cities.</i> This unprecedented assault of Fascism into highly-populated areas puts millions of citizens in grave danger.\n\nThe Helldivers must respond immediately. Illuminate pursuit operations must be temporarily suspended. Repel the Terminid invasion from our cities."},{"id":3264,"published":"2025-06-10T08:55:05Z","type":0,"message":"<i=3>MAJOR ORDER FAILED</i>\n\nThe remnant Illuminate forces have evaded Justice. Some of their remote bases endure.\n\nConsult the Galactic Map for more information."},{"id":3263,"published":"2025-06-06T20:52:39Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nThe first scattered dregs of the cowardly Illuminate invasion force have been located, and traced to several outlying systems.\n\n<i=1>The Helldivers are ordered to liberate all identified hideouts.</i> Intel believes there are more Illuminate planets yet to be identified. The liberation of these sites could lead to the others."},{"id":3262,"published":"2025-06-06T02:13:40Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThanks to the Helldivers’ swift and decisive response, the Automatons' opportunistic assault has been curtailed. Consult the Galactic Map for more information."},{"id":3261,"published":"2025-06-04T15:38:02Z","type":0,"message":"<i=3>COMMEMORATIVE CAPE IN-PROGRESS</i>\n\nA commemorative cape, designed to honor the service and victory of those who fought to defend Super Earth against the Illuminate invasion, has entered production. It will be delivered in the coming weeks."},{"id":3260,"published":"2025-06-03T13:15:59Z","type":0,"message":"<i=3>NEW MAJOR ORDER</i>\n\nDistress calls have been raised from multiple planets. Automaton invasion ships have landed, disrupting ongoing merriment and sanctioned frivolity in the wake of our great victory. The Helldivers must respond immediately to this barbaric assault."},{"id":3259,"published":"2025-05-30T13:22:31Z","type":0,"message":"<i=3>NEW PRESIDENT ELECTED</i>\n\nA new President of Super Earth has been sworn in following a landslide victory in a Managed Election."},{"id":3258,"published":"2025-05-30T12:19:42Z","type":0,"message":"<i=3>MAJOR ORDER WON</i>\n\nThe Illuminate have retreated. The Battle for Super Earth has been won. Consult your Galactic Map for more information."},{"id":3257,"published":"2025-05-29T23:41:09Z","type":0,"message":"<i=3>ILLUMINATE NEARING DEFEAT</i>\n\nThe Illuminate are taking heavy losses. Intel reports their Fleet Strength is rapidly dwindling. They will soon be forced to abandon the assault.\n\nThese are the battle's final hours. The enemy will push with the entirety of their strength. \n\nHold the line. "},{"id":3256,"published":"2025-05-29T23:22:32Z","type":0,"message":"<i=3>MALWARE TRANSMITTED</i>\n\nSatellites on <i=1>FORT UNION</i> have successfully transmitted civilian-created malware to the Illuminate Fleet, resulting in the destruction of multiple large spacecraft. The Illuminate Fleet has suffered 5% damage as a result.\n\nThe unnamed technician who developed the code has been given a field promotion to Command of the 405th Cyberwarfare Detachment."},{"id":3255,"published":"2025-05-29T22:25:36Z","type":0,"message":"<i=3>PRESIDENT KIA</i>\n\nThe President of Super Earth has been killed in action by the Illuminate during the siege of Prosperity City. The President died heroically, defending the Presidential Security bunker with only a pistol against waves of Illuminate foes.\n\nPresidential authority has been placed in the Minister of Defense."},{"id":3254,"published":"2025-05-29T13:11:16Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces to focus offensive efforts on <i=1>Prosperity City.</i>"},{"id":3253,"published":"2025-05-29T10:46:32Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY</i>\n\nA former satellite technician on <i=1>#PLANET</i> has successfully developed malware capable of disabling Illuminate technology. Long-range satellites on the planet are rapidly being outfitted to transmit the code to Illuminate spacecraft. Successful transmission could deal significant damage to the Illuminate Fleet.\n\nHowever, the planet is under threat of Terminid investation. The planet must be defended in order for the plan to succeed."},{"id":3252,"published":"2025-05-29T10:46:02Z","type":0,"message":"<i=1>MEGACITY STATUS REPORT</i>\n\nThe coordinated defensive efforts at <i=1>Equality-on-Sea</i> have pushed the Illuminate to the edges of the city limits. While they continue to attempt to gain a new foothold within the city, the defensive positions by SEAF and Helldiver forces is taking an extra toll on the Illuminate Fleet Strength."},{"id":3249,"published":"2025-05-29T10:08:02Z","type":0,"message":"<i=3>DEFENSES HOLDING</i>\n\nThe Illuminate have launched a desperate last push upon <i=1>Equality-On-Sea</i> and <i=1>Prosperity City</i>, this comes at great cost to their sustained fleet strength. The Helldivers are holding the line. Continue the fight."},{"id":3248,"published":"2025-05-29T10:07:52Z","type":0,"message":"<i=1>MEGACITY UNDER ATTACK</i>\n\nThe Illuminate have launched an attack on Super Earth's Capital: <i=1>Prosperity City.</i>"},{"id":3247,"published":"2025-05-29T10:07:42Z","type":0,"message":"void msg"},{"id":3246,"published":"2025-05-29T10:02:14Z","type":0,"message":"<i=3>STRATEGIC OPPORTUNITY</i>\n\nA former satellite technician on <i=1>#PLANET</i> has successfully developed malware capable of disabling Illuminate technology. Long-range satellites on the planet are rapidly being outfitted to transmit the code to Illuminate spacecraft. Successful transmission could deal significant damage to the Illuminate Fleet.\n\nHowever, the planet is under threat of Terminid investation. The planet must be defended in order for the plan to succeed."},{"id":3245,"published":"2025-05-29T09:49:35Z","type":0,"message":"<i=1>MEGACITY STATUS REPORT</i>\n\nThe coordinated defensive efforts at <i=1>Equality-on-Sea</i> have pushed the Illuminate to the edges of the city limits. While they continue to attempt to gain a new foothold within the city, the defensive positions by SEAF and Helldiver forces is taking an extra toll on the Illuminate Fleet Strength."},{"id":3244,"published":"2025-05-29T09:28:31Z","type":0,"message":"<i=3>DEFENSES HOLDING</i>\n\nThe Illuminate have launched a desperate last push upon <i=1>Equality-On-Sea</i> and <i=1>Prosperity City</i>, this comes at great cost to their sustained fleet strength. The Helldivers are holding the line. Continue the fight."},{"id":3236,"published":"2025-05-28T11:27:55Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces to focus offensive efforts on <i=1>Equality-on-Sea.</i>"},{"id":3235,"published":"2025-05-28T11:08:18Z","type":0,"message":"<i=1>IMPACT STABILIZED</i>\n\nOrbital Stratagem Cooldown times have been returned to normal."},{"id":3234,"published":"2025-05-28T11:24:58Z","type":0,"message":"<i=3>SUPER DEFENSE PROTOCOL DIAMOND</i>\n\nThe fall of a 4th Mega City has triggered the activation of <i=1>Super Defense Protocol Diamond.</i> \n\nSuper Defense Protocol Diamond removes all Collateral Damage Mitigation Procedures. <i=1>All Helldiver loadouts will be augmented with the #STRATAGEM stratagem for Super Earth missions.</i>"},{"id":3225,"published":"2025-05-26T21:42:15Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces away from <i=1>Equality-on-Sea.</i>"},{"id":3224,"published":"2025-05-26T15:27:49Z","type":0,"message":"<i=3>DSS NEARING OPERATIONAL STATUS</i>\n\nRepairs to the <i=1>DSS</i> are nearly complete. However, materials needed to bring it online are scarce. Bringing the station to operational status in time to affect the Battle for Super Earth will require resources to be liberated from the Automatons.\n\nThe dismantling of 200,000,000 Automatons is estimated to be sufficient to effect the immediate full repair of the DSS."},{"id":3223,"published":"2025-05-26T12:08:39Z","type":0,"message":"<i=1>MEGACITY UNDER ATTACK</i>\n\nThe Illuminate have launched an attack on <i=1>Port Mercy.</i>"},{"id":3222,"published":"2025-05-26T12:06:47Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces away from <i=1>York Supreme.</i>"},{"id":3221,"published":"2025-05-26T12:01:32Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces away from <i=1>Equality-on-Sea.</i>"},{"id":3220,"published":"2025-05-25T11:54:00Z","type":0,"message":"<i=1>MEGACITY UNDER ATTACK</i>\n\nThe Illuminate have launched an attack on <i=1>York Supreme.</i>"},{"id":3219,"published":"2025-05-25T09:44:45Z","type":0,"message":"<i=3>OFFENSIVE SHIFT</i>\n\nIntel indicates the Illuminate have shifted their forces to focus offensive efforts on <i=1>Equality-on-Sea.</i>"},{"id":3218